(function () {
    'use strict';

    angular
        .module('app')
        .filter('docTypes', doc_types);

    doc_types.$inject = ['$window'];

    function doc_types($window) {
        var statuses = {
            1: "Техническая спецификация",
            2: "Квалификационные требования",
            3: "Проект договора",
            4: "Заявка на проведение",
            5: "Заявка от заказчика на обработку",
            6: "Заявка от заказчика на биржу",
            7: "Заявка от поставщика на обработку",
            8: "Заявка от поставщика",
            9: "Список претендентов",
            10: "Счет ГО",
            11: "Поручение на сделку",
            12: "Поручение от поставщика",
            13: "Шаблон протокола",
            14: "Протокол с биржи",
            15: "Протокол для заказчика",
            16: "Отчет заказчику",
            17: "Отчет поставщику",
            18: "Счет на оплату",
            19: "Акт о несостоявшемся торге",
            20: "Коммерческое предложение",
            21: "Договор",
            22: "Прочее",
            23: "Заявка от заказчика (оригинал)",
            24: "Проект договора от заказчика на обработку",
            25: "Схема",
            26: "Договор между заказчиком и поставщиком"
        };
        return function (statusId) {
            return statuses[statusId];
        }
    }

})();